cfd/OpenFOAM/incompressible/simpleFoam/validation/ONERA-M6/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/convergenceConditions"
#include "include/relaxationFactors"

// ************************************************************************* //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
        
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
    }

    Phi
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         1;
    }
    
    k
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         1;
    }

    omega
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         1;
    }
}


potentialFlow
{
    nNonOrthogonalCorrectors 3;
}


SIMPLE
{
    residualControl
    {
        p               $convergenceCondition_p;
        U               $convergenceCondition_U;
        k               $convergenceCondition_k;
        omega           $convergenceCondition_omega;
    }
    
    nCorrectors         1;
    nNonOrthogonalCorrectors 2;
    pRefCell            0;
    pRefValue           0;
}


relaxationFactors
{
    fields
    {
        p               $relaxationFactors_p;
    }
    
    equations
    {
        U               $relaxationFactors_U;
        k               $relaxationFactors_k;
        omega           $relaxationFactors_omega;
        epsilon         $relaxationFactors_epsilon;
    }
}


cache
{
    grad(U);
}

// ************************************************************************* //
