cfd/OpenFOAM/incompressible/simpleFoam/validation/ONERA-M6/system/include/materialPoint
// material point coordinates
materialPoint_x 1.0000001;
materialPoint_y 1.0000001;
materialPoint_z 1.0000001;
