cfd/OpenFOAM/incompressible/simpleFoam/validation/ONERA-M6/system/include/referenceData
// reference data for force coefficient computations
referenceLength     0.64607;
referenceArea       0.7532;
