cfd/OpenFOAM/incompressible/simpleFoam/validation/ONERA-M6/system/include/refinementCylinder
// refinement cylinder coordinates
refinementCylinderCenter_x 0.0;
refinementCylinderCenter_y 0.0;
refinementCylinderCenter_z 0.0;

// refinement cylinder dimensions
refinementCylinderRadius 1.0;
refinementCylinderDepth  4.0;

// refinement level
regionRefinementLevel 1;
